Repository: globalpayments/globalpayments-woocommerce
Catalog: languages/globalpayments-gateway-provider-for-woocommerce-*.po
Languages: es_mx, pl_pl

source: This extension allows WooCommerce to use the available Global Payments payment gateways. All card data is tokenized using the respective gateway's tokenization service.
es_mx: Esta extensión permite a WooCommerce utilizar las pasarelas de pago de Global Payments disponibles. Todos los datos de la tarjeta se tokenizan utilizando el servicio de tokenización respectivo de la pasarela.
pl_pl: To rozszerzenie umożliwia WooCommerce korzystanie z dostępnych bramek płatności Global Payments. Wszystkie dane kart są tokenizowane za pomocą usługi tokenizacji odpowiedniej bramki.

source: Pay for Order
es_mx: Pagar por Pedido
pl_pl: Zapłać za zamówienie

source: Admins can process customer orders over the phone using this functionality.
es_mx: Los administradores pueden procesar las ordenes de los clientes desde el telefóno usando esta funcionalidad

source: This order has a transaction ID associated with it already. Click the checkbox to proceed.
es_mx: Este pedido ya tiene un ID de transacción asociado. Haz clic en la casilla para continuar.

source: Ok to process order
es_mx: Haga click en OK para procesar la orden

source: Pay
es_mx: Pagar
pl_pl: Zapłać

source: View Transaction Info
es_mx: Ver Información de la Transacción

source: Admins can view transaction details using this functionality.
es_mx: Los administradores pueden ver los detalles de transacción usando esta funcionalidad.

source: General Info
es_mx: Información General

source: Transaction Id
es_mx: ID de Transacción

source: Transaction Status
es_mx: Estado de la Transacción

source: Transaction Type
es_mx: Tipo de Transacción

source: Amount
es_mx: Cantidad

source: Currency
es_mx: Moneda

source: Provider
es_mx: Proveedor

source: Payment Type
es_mx: Tipo de Pago

source: This page is currently in sandbox/test mode. Do not use real/active card numbers.
es_mx: Esta página se encuentra actualmente en modo sandbox/prueba. No utilice números de tarjetas reales/activos.
pl_pl: Ta strona jest obecnie w trybie testowym. Nie używaj prawdziwych/aktywnych numerów kart.

source: Enable/Disable
es_mx: Habilitar/Deshabilitar
pl_pl: Włącz/Wyłącz

source: Enable Gateway
es_mx: Habilitar puerta de enlace
pl_pl: Włącz bramkę

source: Title
es_mx: Título
pl_pl: Tytuł

source: This controls the title which the user sees during checkout.
es_mx: Esto controla el título que ve el usuario durante el pago.
pl_pl: To ustawienie kontroluje tytuł widoczny dla użytkownika podczas finalizacji zakupu.

source: Credit Card
es_mx: Tarjeta de crédito
pl_pl: Karta kredytowa

source: Payment Action
es_mx: Acción de pago
pl_pl: Akcja płatności

source: Choose whether you wish to capture funds immediately or authorize payment only for a delayed capture.
es_mx: Elija si desea capturar fondos inmediatamente o autorizar el pago sólo para una captura retrasada.
pl_pl: Wybierz, czy chcesz natychmiast przechwycić środki, czy tylko autoryzować płatność dla opóźnionego przechwycenia.

source: Authorize + Capture
es_mx: Autorizar + Captura
pl_pl: Autoryzuj + Przechwycenie

source: Authorize only
es_mx: Solo Autorizar
pl_pl: Tylko autoryzacja

source: Allow Card Saving
es_mx: Permitir Guardar Tarjeta

source: Note: to use the card saving feature, you must have multi-use token support enabled on your account. Please contact <a href="mailto:%s?Subject=WooCommerce%%20Card%%20Saving%%20Option">support</a> with any questions regarding this option.
es_mx: Nota: para usar la función de guardar tarjeta, debe tener habilitado el soporte de token de uso múltiple en su cuenta. Por favor, contacte a <a href="mailto:%s?Subject=WooCommerce%%20Card%%20Saving%%20Option">support</a> con cualquier pregunta sobre esta opción.

source: Order Transaction Descriptor
es_mx: Descriptor de transacción de pedido:

source: During a Capture or Authorize payment action, this value will be passed along as the transaction-specific descriptor listed on the customer's bank account. Please contact <a href="mailto:%s?Subject=WooCommerce%%20Transaction%%20Descriptor%%20Option">support</a> with any questions regarding this option (maxLength: 25).
es_mx: Durante una acción de Captura o Autorización de pago, este valor se pasará como el descriptor específico de la transacción que figura en la cuenta bancaria del cliente. Por favor, contacte a <a href="mailto:%s?Subject=WooCommerce%%20Transaction%%20Descriptor%%20Option">support</a> con cualquier pregunta sobre esta opción (longitud máxima: 25).

source: Check AVS CVN
es_mx: Compruebe AVS CVN

source: Check AVS/CVN result codes and reverse transaction.
es_mx: Verifique los códigos de resultado AVS/CVN y revierta la transacción.

source: This will check AVS/CVN result codes and reverse transaction.
es_mx: Esto verificará los códigos de resultado AVS/CVN y revertirá la transacción.

source: AVS Reject Conditions
es_mx: Condiciones AVS rechazadas

source: Choose for which AVS result codes, the transaction must be auto reversed.
es_mx: Elija para qué códigos de resultado AVS la transacción debe revertirse automáticamente.

source: CVN Reject Conditions
es_mx: Condiciones de rechazo de CVN

source: Choose for which CVN result codes, the transaction must be auto reversed.
es_mx: Elija para qué códigos de resultado CVN la transacción debe revertirse automáticamente.

source: Credit Card Number
es_mx: Número de tarjeta de crédito
pl_pl: Numer karty kredytowej

source: Please enter a valid Credit Card Number
es_mx: Por favor ingrese un número válido de Tarjeta de Crédito
pl_pl: Proszę wprowadzić prawidłowy numer karty kredytowej

source: Credit Card Expiration Date
es_mx: Fecha de expiración de la tarjeta de Crédito
pl_pl: Data ważności karty kredytowej

source: MM / YYYY
es_mx: MM / AAAA
pl_pl: MM / RRRR

source: Please enter a valid Credit Card Expiration Date
es_mx: Por favor ingrese una fecha válida de expiración de la Tarjeta de Crédito
pl_pl: Proszę wprowadzić prawidłową datę ważności karty kredytowej

source: Credit Card Security Code
es_mx: Código de seguridad de la Tarjeta de Crédito
pl_pl: Kod bezpieczeństwa karty kredytowej

source: Please enter a valid Credit Card Security Code
es_mx: Por favor ingrese un código de seguridad válido de la tarjeta de Crédito
pl_pl: Proszę wprowadzić prawidłowy kod bezpieczeństwa karty kredytowej

source: Order created with Transaction ID: %s
es_mx: Orden creada con el ID de Transacción: %s

source: authorized
es_mx: autorizado

source: charged
es_mx: cargado

source: Refund amount must be a valid number
es_mx: El monto de reembolso debe de ser un número válido

source: Refund amount must be greater than zero.
es_mx: El monto del reembolso debe ser mayor a cero.

source: %s%s was reversed or refunded. Transaction ID: %s
es_mx: %s%s fue revertido o reembolsado. ID de transacción: %s

source: Transaction captured. Transaction ID for the capture: %s
es_mx: Transacción capturada. ID de transacción para la captura: %s

source: Capture credit card authorization
es_mx: Capturar la autorización de la tarjeta de crédito.

source: A - Address matches, zip No Match
es_mx: A - Coincidencias de dirección, código postal No coincide

source: N - Neither address or zip code match
es_mx: N: ni la dirección ni el código postal coinciden

source: R - Retry - system unable to respond
es_mx: R - Reintentar - el sistema no puede responder

source: U - Visa / Discover card AVS not supported
es_mx: U - Tarjeta Visa / Discover AVS no compatible

source: S - Master / Amex card AVS not supported
es_mx: S - Tarjeta Master/Amex AVS no compatible

source: Z - Visa / Discover card 9-digit zip code match, address no match
es_mx: Z - Tarjeta Visa / Discover Coincidencia de código postal de 9 dígitos, dirección no coincidente

source: W - Master / Amex card 9-digit zip code match, address no match
es_mx: W - Coincidencia de código postal de 9 dígitos de la tarjeta Master/Amex, dirección no coincidente

source: Y - Visa / Discover card 5-digit zip code and address match
es_mx: Y - Coincidencia de dirección y código postal de 5 dígitos de la tarjeta Visa/Discover

source: X - Master / Amex card 5-digit zip code and address match
es_mx: X - Coincidencia de dirección y código postal de 5 dígitos de la tarjeta Master/Amex

source: G - Address not verified for International transaction
es_mx: G - Dirección no verificada para transacciones internacionales

source: B - Address match, Zip not verified
es_mx: B - Coincidencia de dirección, código postal no verificado

source: C - Address and zip mismatch
es_mx: C - La dirección y el zip no coinciden

source: D - Address and zip match
es_mx: D - Coincidencia de dirección y código postal

source: I - AVS not verified for International transaction
es_mx: I - AVS no verificado para transacciones internacionales

source: M - Street address and postal code matches
es_mx: M - Coincidencias de dirección y código postal

source: P - Address and Zip not verified
es_mx: P - Dirección y código postal no verificados

source: N - Not Matching
es_mx: N - No coincidente

source: P - Not Processed
es_mx: P - No procesado

source: S - Result not present
es_mx: S - Resultado no presente

source: U - Issuer not certified
es_mx: U - Emisor no certificado

source: ? - CVV unrecognized
es_mx: ? - CVV no reconocido

source: You can enable only one GlobalPayments gateway at a time. Please disable %s first!
es_mx: Solo puede habilitar un Gateway de GlobalPayments a la vez. Por favor, deshabilite %s primero!

source: Unable to perform request.
es_mx: No se puede realizar la solicitud. Datos no válidos.

source: 3DS Authentication failed. Please try again.
es_mx: Error de autenticación 3DS. Por favor inténtalo de nuevo.

source: Connect to the TSYS Genius gateway
es_mx: Conectar al TSYS Genius gateway

source: Live Mode
es_mx: Modo en vivo

source: Get your credentials from your TSYS Genius account.
es_mx: Obtenga sus credenciales de su cuenta TSYS Genius.

source: Live Merchant Name
es_mx: Nombre del Comerciante en Vivo

source: Live Merchant Site ID
es_mx: ID del Sitio del Comerciante en Vivo

source: Live Merchant Key
es_mx: Clave del Comerciante en Vivo

source: Live Web API Key
es_mx: Clave API web en vivo

source: Sandbox Merchant Name
es_mx: Nombre del Comerciante en Sandbox

source: Sandbox Merchant Site ID
es_mx: ID del Sitio del Comerciante en Sandbox

source: Sandbox Merchant Key
es_mx: Clave del Comerciante en Sandbox

source: Sandbox Web API Key
es_mx: Clave API Web de Sandbox

source: Connect to the Unified Payments Gateway
es_mx: Conéctese a la pasarela de pagos unificada

source: Get your App Id and App Key from your <a href="https://developer.globalpay.com/user/register" target="_blank">Global Payments Developer Account</a>. Please follow the instructions provided in the <a href="https://wordpress.org/plugins/global-payments-woocommerce/" target="_blank">plugin description</a>.<br/>When you are ready for Live, please contact <a href="mailto:%s?Subject=WooCommerce%%20Live%%20Credentials">support</a> to get you live credentials.
es_mx: Obtenga su ID de Aplicación y Clave de Aplicación de su <a href="https://developer.globalpay.com/user/register" target="_blank">Global Payments Developer Account</a>. Por favor, siga las instrucciones proporcionadas en <a href="https://wordpress.org/plugins/global-payments-woocommerce/" target="_blank">plugin description</a>.<br/>When you are ready for Live, please contact <a href="mailto:%s?Subject=WooCommerce%%20Live%%20Credentials">support</a> para obtener sus credeciales en vivo

source: Live App Id*
es_mx: ID de la aplicación en vivo*

source: Live App Key*
es_mx: Clave de aplicación en vivo*

source: Sandbox App Id*
es_mx: ID de la aplicación Sandbox*

source: Sandbox App Key*
es_mx: Clave de la aplicación Sandbox*

source: Credentials check
es_mx: Verificación de credenciales:

source: Note: The Payment Methods will not be displayed at checkout if the credentials are not correct.
es_mx: Nota: los métodos de pago no se mostrarán al finalizar la compra si las credenciales no son correctas

source: General Settings
es_mx: Configuraciones generales

source: Enable Logging
es_mx: Habilitar registro

source: Log all requests to and from the gateway. This can also log private data and should only be enabled in a development or stage environment.
es_mx: Registre todas las solicitudes hacia y desde la puerta de enlace. Esto también puede registrar datos privados y solo debe habilitarse en un entorno de desarrollo o etapa.

source: Invalid MultiPass User ID or Password. Please try again.
es_mx: ID de Usuario o Contraseña de MultiPass inválido. Por favor, inténtelo de nuevo.

source: Contact Url*
es_mx: Url de contacto*

source: A link to an About or Contact page on your website with customer care information (maxLength: 256).
es_mx: Un enlace a una página Acerca de o Contacto en su sitio web con información de atención al cliente (longitud máxima: 256)

source: Enable 3D Secure
es_mx: Habilitar 3D Secure:

source: Card Holder Name
es_mx: Nomnre del Tarjetahabiente

source: Please enter a valid Card Holder Name
es_mx: Por favor ingrese un nombre válido del Tarjetahabiente

source: Please provide Live Credentials.
es_mx: Por favor proporcione credenciales en vivo.

source: Please provide Sandbox Credentials.
es_mx: Por favor proporcione las credenciales de Sandbox.

source: Transaction API
es_mx: API de Transacción

source: Connect to the Transaction API
es_mx: Conectar a la API de Transacción

source: Live Public Key
es_mx: Clave Pública en Vivo

source: Live API Key
es_mx: Clave API en Vivo

source: Live API Secret
es_mx: Secreto API en Vivo

source: Live Account Credential
es_mx: Credencial de Cuenta en Vivo

source: Sandbox Public Key
es_mx: Clave Pública de Sandbox

source: Sandbox API Key
es_mx: Clave API de Sandbox

source: Sandbox API Secret
es_mx: Secreto API de Sandbox

source: Sandbox Account Credential
es_mx: Credencial de Cuenta de Sandbox

source: Region
es_mx: Región

source: Connect to the Heartland Portico gateway
es_mx: Conectar a la puerta de enlace Heartland Portico

source: Get your API keys from your Heartland Online Payments account.
es_mx: Obtenga sus claves API de su cuenta de Pagos en Línea de Heartland.

source: Live Secret Key
es_mx: Clave Secreta en Vivo

source: Sandbox Secret Key
es_mx: Clave Secreta de Sandbox

source: Enable Gift Cards
es_mx: Habilitar Tarjetas de Regalo

source: Allow customers to use gift cards to pay for purchases in full or in part.
es_mx: Permitir a los clientes usar tarjetas de regalo para pagar compras total o parcialmente.

source: This will display a gift card entry field directly below the credit card entry area.
es_mx: Esto mostrará un campo de entrada de tarjeta de regalo directamente debajo del área de entrada de tarjeta de crédito.

source: Your order
es_mx: Su pedido

source: Not enough data to perform 3DS. Unable to retrieve token.
es_mx: No hay suficientes datos para realizar 3DS. No se pudo recuperar el token.

source: Please try again with another card.
es_mx: Por favor, inténtelo de nuevo con otra tarjeta.

source: Invalid check api credentials request.
es_mx: Solicitud de verificación de credenciales de API no válida.

source: App Id or App Key fields are invalid
es_mx: Los campos App Id o App Key son inválidos.

source: Your credentials were successfully confirmed!
es_mx: ¡Tus credenciales fueron confirmadas exitosamente!

source: Unable to perform request. Invalid data.
es_mx: No se puede realizar la solicitud. Datos no válidos.

source: Invalid payment request.
es_mx: Solicitud de pago no válida.

source: Invalid amount. Order total must be greater than zero.
es_mx: Monto inválido. El total del pedido debe ser mayor que cero.

source: This order has a transaction ID associated with it already. Please click the checkbox to proceed with payment.
es_mx: Este pedido ya tiene un ID de transacción asociado. Por favor, marque la casilla para proceder con el pago.

source: Something went wrong while processing the payment.
es_mx: Algo salió mal al procesar el pago.

source: Invalid view transaction request.
es_mx: Solicitud de verificación de transacción no válida.

source: Invalid transaction id.
es_mx: ID de transacción no válido.

source: Connect to the TSYS TransIT gateway with TSEP
es_mx: Conectar a la puerta de enlace TSYS TransIT con TSEP

source: Get your API keys from your TSYS TransIT account.
es_mx: Obtenga sus claves API de su cuenta TSYS TransIT.

source: Live Merchant ID
es_mx: ID del Comerciante en Vivo

source: Live MultiPass User ID
es_mx: ID de Usuario MultiPass en Vivo

source: Live Password
es_mx: Contraseña en Vivo

source: Live Device ID
es_mx: ID del Dispositivo en Vivo

source: Live TSEP Device ID
es_mx: ID del Dispositivo TSEP en Vivo

source: Live Transaction Key
es_mx: Clave de Transacción en Vivo

source: Sandbox Merchant ID
es_mx: ID del Comerciante en Sandbox

source: Sandbox MultiPass User ID
es_mx: ID de Usuario MultiPass en Sandbox

source: Sandbox Password
es_mx: Contraseña de Sandbox

source: Sandbox Device ID
es_mx: ID del Dispositivo en Sandbox

source: Sandbox TSEP Device ID
es_mx: ID del Dispositivo TSEP en Sandbox

source: Sandbox Transaction Key
es_mx: Clave de Transacción en Sandbox

source: Order ID: %s. Order not found.
es_mx: ID de Pedido: %s. Pedido no encontrado.

source: Order ID: %s. Payment method code changed. Expected %s, but found %s
es_mx: ID de Pedido: %s. Código de método de pago cambiado. Se esperaba %s, pero se encontró %s

source: Order ID: %s. Transaction ID changed. Expected %s, but found %s
es_mx: ID de Pedido: %s. ID de transacción cambiado. Se esperaba %s, pero se encontró %s

source: This request method is not supported.
es_mx: Este método de solicitud no es compatible.

source: Invalid request signature.
es_mx: Firma de solicitud no válida.

source: Order ID: %s. Unexpected transaction status on returnUrl: %s
es_mx: ID de pedido: %s. Estado de transacción inesperado en returnUrl: %s

source: Error completing order return with %s. %s %s
es_mx: Error al completar la devolución del pedido con %s. %s %s

source: Captured
es_mx: Capturada

source: Order ID: %s. Unexpected transaction status on statusUrl: %s
es_mx: ID de Pedido: %s. Estado de transacción inesperado en statusUrl: %s

source: Error completing order status with %s. %s %s
es_mx: Error al completar el estado del pedido con %s. %s %s

source: Payment of %1$s declined/failed. Transaction ID: %2$s
es_mx: Pago de %1$s rechazado/fallido. ID de transacción: %2$s

source: %1$s payment canceled by customer. Transaction ID: %2$s.
es_mx: Pago de %1$s cancelado por el cliente. ID de transacción: %2$s.

source: Error completing order cancel with %s. %s %s
es_mx: Error al completar la cancelación del pedido con %s. %s %s

source: Thank you. Your order has been received, but we have encountered an issue when redirecting back. Please contact us for assistance.
es_mx: Gracias. Su pedido ha sido recibido, pero hemos encontrado un problema al redirigir nuevamente. Por favor contáctenos para obtener ayuda.

source: Enable payment method
es_mx: Habilitar método de pago
pl_pl: Włącz metodę płatności

source: Pay with PayPal
es_mx: Pague con PayPal

source: Connect to PayPal via Unified Payments Gateway
es_mx: Conectar a PayPal a través del Gateway de United Payments

source: %1$s payment initiated with %3$s. Transaction ID: %2$s.
es_mx: Pago de %1$s iniciado con %3$s. ID de transacción: %2$s.

source: %1$s amount of %2$s. Transaction ID: %3$s.
es_mx: %1$s cantidad de %2$s. ID de transacción: %3$s.

source: Authorized amount of %1$s. Transaction ID: %2$s.
es_mx: Cantidad autorizada de %1$s. ID de transacción: %2$s.

source: Captured amount of %1$s. Transaction ID: %2$s.
es_mx: Cantidad capturada de %1$s. ID de transacción: %2$s.

source: <strong>Billing ZIP Code</strong> is a required field for this payment method.
es_mx: <strong>Código Postal de Facturación</strong> es un campo obligatorio para este método de pago.

source: <strong>Shipping ZIP Code</strong> is a required field for this payment method.
es_mx: <strong> Código Postal de Envío </strong>es un campo obligatorio para este método de pago.

source: <strong>Phone</strong> is a required field for this payment method.
es_mx: <strong>Teléfono</strong> es un campo obligatorio para este método de pago.

source: Pay with Affirm
es_mx: Pague con Affirm

source: Connect to Affirm via Unified Payments Gateway
es_mx: Conéctese para Affirm a través de Unified Payments Gateway

source: Pay with Clearpay
es_mx: Pague con Clearpay

source: Connect to Clearpay via Unified Payments Gateway
es_mx: Conéctese a Clearpay a través de Unified Payments Gateway

source: Pay with Klarna
es_mx: Pague con Klarna

source: Connect to Klarna via Unified Payments Gateway
es_mx: Conectar a Klarna a través del Gateway de United Payments

source: Pay with Apple Pay
es_mx: Pago con Apple Pay

source: Connect to Apple Pay via Unified Payments Gateway
es_mx: Conéctese a Apple Pay a través de Unified Payments Gateway

source: Apple Merchant ID*
es_mx: Merchant ID de Apple*

source: Apple Merchant Cert Path*
es_mx: Certh Path del Apple Merchant *

source: Apple Merchant Key Path*
es_mx: Key Path del Apple Merchant *

source: Apple Merchant Key Passphrase
es_mx: Key Passphrase del Apple Merchant

source: Apple Merchant Domain*
es_mx: Dominio del Apple Merchant *

source: Apple Merchant Display Name*
es_mx: Display Name del Apple Merchant*

source: Accepted Cards*
es_mx: Tarjetas aceptadas

source: Apple button color
es_mx: Color del botón de Apple

source: Button styling at checkout
es_mx: Estilo del botón en el pago

source: Black
es_mx: Negro

source: White
es_mx: Blanco

source: White with Outline
es_mx: Blanco con Contorno

source: Pay with Click To Pay
es_mx: Pague con Click to Pay

source: Connect to Click To Pay via Unified Payments Gateway
es_mx: Conéctese para hacer clic para pagar a través de Unified Payments Gateway

source: Click To Pay Client ID*
es_mx: ID de cliente Click to Pay*

source: Your Merchant ID provided by Click To Pay.
es_mx: Su ID de Comerciante proporcionado por Click To Pay.

source: Render Click To Pay natively
es_mx: Renderizar Click to Pay de forma nativa

source: Click To Pay will render natively within the payment form
es_mx: Click To Pay se mostrará de forma nativa dentro del formulario de pago.

source: Accept Canadian Visa debit cards
es_mx: Acepte tarjetas de débito Visa canadienses

source: Display Global Payments footer
es_mx: Mostrar pie de página de Global Payments

source: Display Global Payments footer within the payment form
es_mx: Mostrar el pie de página de Global Payments dentro del formulario de pago

source: Click To Pay Billing
es_mx: Haz Click para pagar la facturación

source: Email address:
es_mx: Dirección de correo electrónico:

source: Click To Pay Shipping
es_mx: Haz Click para pagar envio

source: Pay with Google Pay
es_mx: Pagar con Google Pay

source: Connect to Google Pay via Unified Payments Gateway
es_mx: Conéctese a Google Pay a través de Unified Payments Gateway

source: Global Payments Client ID*
es_mx: ID de Cliente Global Payments*

source: Your Client ID provided by Global Payments.
es_mx: Votre ID de client fourni par Global Payments.

source: Google Merchant ID
es_mx: ID de marchand Google

source: Your Merchant ID provided by Google.
es_mx: Su Merchant ID proporcionado por Google.

source: Google Merchant Display Name
es_mx: Nombre mostrado del Google Merchant

source: Displayed to the customer in the Google Pay dialog.
es_mx: Se muestra al cliente en el diálogo de Google Pay.

source: Allowed Card Auth Methods*
es_mx: Métodos de autenticación de tarjeta permitidos

source: Button Color
es_mx: Color del botón

source: Bank Payment
es_mx: Pago Bancario

source: GlobalPayments - Bank Payment
es_mx: GlobalPayments - Pago Bancario
