Repository: globalpayments/globalpayments-woocommerce
Catalog: languages/globalpayments-gateway-provider-for-woocommerce-*.po
Languages: es_mx, pl_pl

source: Connect to Bank Payments via Unified Payments Gateway
es_mx: Conectar a Pagos Bancarios a través del Gateway de United Payments

source: Account Number
es_mx: Número de cuenta

source: Account number, for bank transfers within the UK (UK to UK bank). Only required if no bank details are stored on account.
es_mx: Número de cuenta, para transferencias bancarias dentro del Reino Unido (banco del Reino Unido a Reino Unido). Solo es necesario si no se almacenan datos bancarios en la cuenta.

source: Account Name
es_mx: Nombre de cuenta

source: The name of the individual or business on the bank account. Only required if no bank details are stored on account.
es_mx: El nombre de la persona o empresa en la cuenta bancaria. Solo es necesario si no se almacenan datos bancarios en la cuenta.

source: Only required for EUR transacting merchants.
es_mx: Solo requerido para comerciantes que transaccionan en EUR.

source: Sort Code
es_mx: Código de clasificación

source: Six digits which identify the bank and branch of an account. Included with the Account Number for UK to UK bank transfers. Only required if no bank details are stored on account.
es_mx: Seis dígitos que identifican el banco y la sucursal de una cuenta. Incluido con el número de cuenta para transferencias bancarias del Reino Unido a Reino Unido. Solo es necesario si no se almacenan datos bancarios en la cuenta.

source: Countries
es_mx: Países

source: Currencies*
es_mx: Monedas*

source: Note: The payment method will be displayed at checkout only for the selected currencies.
es_mx: Nota: El método de pago se mostrará al finalizar la compra solo para las monedas seleccionadas.

source: Your payment was unsuccessful. Please try again or use a different payment method.
es_mx: Su pago no fue exitoso. Inténtalo de nuevo o utilice un método de pago diferente.
pl_pl: Twoja płatność nie powiodła się. Spróbuj ponownie lub użyj innej metody płatności.

source: An error occurred while processing the payment. Please try again or use a different payment method.
es_mx: Se produjo un error al procesar el pago. Inténtalo de nuevo o utiliza un método de pago diferente.
pl_pl: Wystąpił błąd podczas przetwarzania płatności. Spróbuj ponownie lub użyj innej metody płatności.

source: Specify which account to use when processing a transaction. Default account will be used if this is not specified.
es_mx: Especifique qué cuenta usar al procesar una transacción. Se usará la cuenta predeterminada si no se especifica.

source: Sandbox Account Name
es_mx: Nombre de la Cuenta de Sandbox

source: PAN_ONLY: This authentication method is associated with payment cards stored on file with the user's Google Account. CRYPTOGRAM_3DS: This authentication method is associated with cards stored as Android device tokens. PAN_ONLY can expose the FPAN, which requires an additional SCA step up to a 3DS check. Currently, Global Payments does not support the Google Pay SCA challenge with an FPAN. For the best acceptance, we recommend that you provide only the CRYPTOGRAM_3DS option.
es_mx: PAN_ONLY: este método de autenticación está asociado con las tarjetas de pago almacenadas en el archivo de la cuenta de Google del usuario. CRYPTOGRAM_3DS: este método de autenticación está asociado con tarjetas almacenadas como tokens de dispositivos Android. PAN_ONLY puede exponer el FPAN, lo que requiere un paso SCA adicional hasta una verificación 3DS. Actualmente, Global Payments no admite el desafío SCA de Google Pay con una FPAN. Para una mejor aceptación, le recomendamos que proporcione únicamente la opción CRYPTOGRAM_3DS.

source: Allows you to input a COUNTRY or string of COUNTRIES to limit what is shown to the customer. Including a country overrides your default account configuration. <br/><br/> Format: List of ISO 3166-2 (two characters) codes separated by a | <br/><br/> Example: FR|GB|IE
es_mx: Le permite ingresar un PAÍS o una cadena de PAÍSES para limitar lo que se muestra al cliente. La inclusión de un país anula la configuración predeterminada de su cuenta. <br/><br/> Formato: Lista de códigos ISO 3166-2 (dos caracteres) separados por | <br/><br/> Example: FR|GB|IE
